{"data":{"allStrapiJobs":{"nodes":[{"strapiId":3,"company":"Realeaf","date":"July 2015 - December 2015","position":"Frontend Developer Intern","desc":[{"id":42,"name":"Adjusted software parameters to boost performance and incorporate new features."},{"id":46,"name":"Boosted network, system, and data availability and integrity through preventative maintenance and upgrades."},{"id":47,"name":"Reviewed code, debugged problems, and corrected issues."},{"id":48,"name":"Orchestrated efficient large-scale software deployments, including testing features and correcting code."},{"id":43,"name":"Managed milestones from initial steps through final delivery."},{"id":44,"name":"Consulted with engineering team members to determine system loads and develop improvement plans."},{"id":45,"name":"Discussed project progress with customers, collected feedback on different stages, and directly addressed concerns."}]},{"strapiId":2,"company":"Paystack Inc.","date":"January 2018 - August 2019","position":"Snr. Frontend Developer","desc":[{"id":11,"name":"Delivered performance-driven and user-centric websites that met all business requirements."},{"id":17,"name":"Orchestrated efficient large-scale software deployments, including testing features and correcting code."},{"id":21,"name":"Reviewed code, debugged problems and corrected issues."},{"id":20,"name":"Gathered and defined customer requirements to develop clear specifications for project plans."},{"id":12,"name":"Discussed project progress with customers, collected feedback on different stages and directly addressed concerns."},{"id":13,"name":"Adjusted design parameters to boost performance and incorporate new features."},{"id":14,"name":"Managed milestones from initial steps through final delivery."},{"id":15,"name":"Consulted with engineering team members to determine system loads and develop improvement plans."},{"id":16,"name":"Contributed ideas and suggestions in team meetings and delivered updates on deadlines, designs and enhancements."},{"id":22,"name":"Conceived and built optimized landing pages in HTML and CSS, including API integration and cross-browser compatibility, to support marketing."},{"id":18,"name":"Spearheaded production of page content such as visuals and text copy to meet project specifications."},{"id":19,"name":"Planned and engineered RESTful web services to manipulate dynamic datasets."},{"id":23,"name":"Collected, defined and translated user requirements into project designs and implementation plans."}]},{"strapiId":1,"company":"AppZone Group","date":"July 2016 - January 2018","position":"Frontend Developer","desc":[{"id":24,"name":"Consulted with customers to gather requirements and discuss design choices."},{"id":34,"name":"Produced websites compatible with multiple browsers."},{"id":41,"name":"Drafted design timeline specifications to create accurate project deadlines and set budgetary metrics."},{"id":40,"name":"Developed customer-facing communications with measurable click-thru rates for marketing conversion tracking."},{"id":25,"name":"Collaborated with stakeholders during development processes to confirm creative proposals and design best practices."},{"id":26,"name":"Pinpointed user experience issues to devise targeted suggestions for creating cohesive user experience."},{"id":27,"name":"Adhered to internal risk control and liability mitigation guidelines."},{"id":28,"name":"Reviewed and tested customer-facing prototypes before deployment, applying best practice diagnostic techniques to verify usability."},{"id":29,"name":"Worked in Agile-driven environment to effectively maintain project timelines and utilize available resources."},{"id":30,"name":"Verified all web-based products fulfilled prescribed project needs through direct interaction with stakeholders."},{"id":31,"name":"Generated design frameworks designed to encourage maximal user response rates to ad placements."},{"id":32,"name":"Developed designs to meet specific requirements such as quick-loading sites with particular layouts."},{"id":33,"name":"Planned and engineered RESTful web services to manipulate dynamic datasets."},{"id":35,"name":"Collaborated with in-house web designers to create sleek and innovative UI design."},{"id":36,"name":"Crafted SEO strategy and intuitive interface for web and mobile site to achieve prominent rankings across top browser platforms, including Google and Alexa."},{"id":37,"name":"Took concepts and produced design mockups and prototypes to strengthen designs, enhance user experiences and improve site interactions."},{"id":38,"name":"Created powerful Content Management Systems to serve as interface for client."},{"id":39,"name":"Employed coding practices based on commonly accepted standards to establish site layout and user interface."}]}]}}}